<details>
<summary>Execution result of "run --all --non-interactive --summary-per-unit --log-level stderr --log-format bare -- plan" in "IaC/production/homelab"</summary>

```terraform

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
helm_release.nfs_subdir_external_provisioner: Refreshing state... [id=nfs-subdir-external-provisioner]
helm_release.nfs_database: Refreshing state... [id=nfs-subdir-external-provisioner-database]
helm_release.nfs_media: Refreshing state... [id=nfs-subdir-external-provisioner-media]
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/helm v3.1.1 to the shared cache directory...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
kubernetes_namespace_v1.external_secrets: Refreshing state... [id=external-secrets]
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_secret_v1.name: Refreshing state... [id=external-secrets/aws-ssm-secret]
helm_release.release: Refreshing state... [id=external-secrets]
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.metrics: Refreshing state... [id=metrics-server]
kubernetes_namespace_v1.metallb_system: Refreshing state... [id=metallb-system]
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
helm_release.release: Refreshing state... [id=metrics-server]
helm_release.metallb: Refreshing state... [id=metallb]
kubernetes_namespace_v1.longhorn_system: Refreshing state... [id=longhorn-system]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
helm_release.longhorn: Refreshing state... [id=longhorn]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
kubernetes_manifest.external_secrets_secret_store: Refreshing state...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # helm_release.release will be updated in-place
  ~ resource "helm_release" "release" {
      ~ id                         = "external-secrets" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v1.3.1" -> (known after apply)
          ~ chart          = "external-secrets" -> (known after apply)
          ~ first_deployed = 1766553801 -> (known after apply)
          ~ last_deployed  = 1769404179 -> (known after apply)
          ~ name           = "external-secrets" -> (known after apply)
          ~ namespace      = "external-secrets" -> (known after apply)
          ~ notes          = <<-EOT
                external-secrets has been deployed successfully in namespace external-secrets!
                
                In order to begin using ExternalSecrets, you will need to set up a SecretStore
                or ClusterSecretStore resource (for example, by creating a 'vault' SecretStore).
                
                More information on the different types of SecretStores and how to configure them
                can be found in our Github: https://github.com/external-secrets/external-secrets
            EOT -> (known after apply)
          ~ revision       = 4 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "1.3.1" -> (known after apply)
        } -> (known after apply)
        name                       = "external-secrets"
      ~ set_wo                     = (write-only attribute)
      ~ version                    = "1.3.1" -> "1.3.2"
        # (27 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
kubernetes_manifest.ip_address_pool: Refreshing state...
kubernetes_manifest.l2_advertisement: Refreshing state...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.traefik: Refreshing state... [id=traefik]
helm_release.traefik: Refreshing state... [id=traefik]
kubernetes_manifest.traefik_certificate: Refreshing state...
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
kubernetes_namespace_v1.argocd: Refreshing state... [id=argocd]
helm_release.argocd_image_updater: Refreshing state... [id=argocd-image-updater]
helm_release.release: Refreshing state... [id=argocd]
aws_ssm_parameter.argocd["client_secret"]: Refreshing state... [id=/homelab/argocd/client_secret]
kubernetes_manifest.argocd_certificate: Refreshing state...
kubernetes_manifest.argocd_secret: Refreshing state...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # helm_release.argocd_image_updater will be updated in-place
  ~ resource "helm_release" "argocd_image_updater" {
      ~ id                         = "argocd-image-updater" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v1.0.2" -> (known after apply)
          ~ chart          = "argocd-image-updater" -> (known after apply)
          ~ first_deployed = 1754265078 -> (known after apply)
          ~ last_deployed  = 1767400104 -> (known after apply)
          ~ name           = "argocd-image-updater" -> (known after apply)
          ~ namespace      = "argocd" -> (known after apply)
          ~ notes          = "" -> (known after apply)
          ~ revision       = 16 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - extraArgs = [
                      - "--interval",
                      - "2m",
                    ]
                }
            ) -> (known after apply)
          ~ version        = "1.0.4" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd-image-updater"
      ~ set_wo                     = (write-only attribute)
      ~ version                    = "1.0.4" -> "1.1.1"
        # (27 unchanged attributes hidden)
    }

  # helm_release.release will be updated in-place
  ~ resource "helm_release" "release" {
      ~ id                         = "argocd" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v3.2.6" -> (known after apply)
          ~ chart          = "argo-cd" -> (known after apply)
          ~ first_deployed = 1747803855 -> (known after apply)
          ~ last_deployed  = 1769404241 -> (known after apply)
          ~ name           = "argocd" -> (known after apply)
          ~ namespace      = "argocd" -> (known after apply)
          ~ notes          = <<-EOT
                In order to access the server UI you have the following options:
                
                1. kubectl port-forward service/argocd-server -n argocd 8080:443
                
                    and then open the browser on http://localhost:8080 and accept the certificate
                
                2. enable ingress in the values file `server.ingress.enabled` and either
                      - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                      - Set the `configs.params."server.insecure"` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                
                
                After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                
                kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                
                (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
            EOT -> (known after apply)
          ~ revision       = 40 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - applicationSet = {
                      - metrics = {
                          - enabled        = true
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - selector         = {
                                  - release = "prometheus"
                                }
                            }
                        }
                    }
                  - configs        = {
                      - cm     = {
                          - "accounts.app_user"         = "apiKey"
                          - "accounts.app_user.enabled" = true
                          - "dex.config"                = <<-EOT
                                "connectors":
                                - "config":
                                    "clientID": "5dd3e953-5c5d-4854-b284-a9f1fd0d00fa"
                                    "clientSecret": "${dex.azure.clientSecret}"
                                    "redirectURI": "https://argocd.stinkyboi.com/api/dex/callback"
                                    "tenant": "2aee152b-5281-40d0-8f4b-60faf40514ab"
                                  "id": "microsoft"
                                  "name": "Azure"
                                  "type": "microsoft"
                            EOT
                        }
                      - params = {
                          - "server.insecure" = "true"
                        }
                      - rbac   = {
                          - create           = true
                          - "policy.csv"     = <<-EOT
                                p, app_user, *, *, *, allow
                            EOT
                          - "policy.default" = "role:admin"
                        }
                      - secret = {
                          - createSecret = true
                        }
                    }
                  - controller     = {
                      - metrics = {
                          - enabled        = true
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - selector         = {
                                  - release = "prometheus"
                                }
                            }
                        }
                    }
                  - global         = {
                      - addPrometheusAnnotations = "false"
                      - domain                   = "argocd.stinkyboi.com"
                      - env                      = [
                          - {
                              - name      = "dex.azure.clientSecret"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "client_secret"
                                      - name = "dex-oidc-secret"
                                    }
                                }
                            },
                        ]
                    }
                  - image          = {
                      - pullPolicy = "Always"
                    }
                  - notifications  = {
                      - metrics = {
                          - enabled        = true
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - selector         = {
                                  - release = "prometheus"
                                }
                            }
                        }
                    }
                  - repoServer     = {
                      - metrics = {
                          - enabled        = true
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - selector         = {
                                  - release = "prometheus"
                                }
                            }
                        }
                    }
                  - server         = {
                      - certificate = {
                          - enabled    = true
                          - issuer     = {
                              - group = "cert-manager.io"
                              - kind  = "ClusterIssuer"
                              - name  = "cloudflare-clusterissuer"
                            }
                          - secretName = "argocd-server-tls"
                        }
                      - ingress     = {
                          - annotations      = {
                              - "traefik.ingress.kubernetes.io/router.entrypoints" = "websecure"
                            }
                          - enabled          = true
                          - ingressClassName = "traefik"
                          - tls              = true
                        }
                      - metrics     = {
                          - enabled        = true
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - selector         = {
                                  - release = "prometheus"
                                }
                            }
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "9.3.5" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd"
      ~ set_wo                     = (write-only attribute)
      ~ version                    = "9.3.5" -> "9.4.3"
        # (28 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file


Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵

- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵


Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵

- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵


Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵

- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵


Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵

- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵

- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵

- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵

- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵

- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵

- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵

- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
╷
│ Error: Failed to resolve provider packages
│ 
│ Could not resolve provider argoproj-labs/argocd: locked provider
│ registry.opentofu.org/argoproj-labs/argocd 7.12.5 does not match configured
│ version constraint 7.13.0; must use tofu init -upgrade to allow selection
│ of new versions
╵


❯❯ Run Summary  21 units  3m
   ────────────────────────────
   Succeeded (7)
      argocd ............ 46s
      metallb ........... 14s
      traefik ........... 12s
      external-secrets .. 11s
      longhorn .......... 10s
      metrics ........... 8s
      storage ........... 4s
   Failed (14)
      litellm ........... 2m
      open-webui ........ 2m
      homeassistant ..... 2m
      cert-manager ...... 2m
      descheduler ....... 2m
      technitium ........ 2m
      octobot ........... 2m
      n8n ............... 2m
      cloudflare-tunnel . 2m
      tailscale ......... 2m
      database .......... 2m
      monitoring ........ 2m
      minecraft ......... 2m
      homarr ............ 2m
```

</details>
    
